-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Oct 11, 2023 at 05:19 PM
-- Server version: 8.0.34
-- PHP Version: 8.1.16

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `vswtsdio_1402s1403`
--

-- --------------------------------------------------------

--
-- Table structure for table `atendence`
--

CREATE TABLE `atendence` (
  `id` int NOT NULL,
  `codemeli` bigint NOT NULL,
  `atendence` varchar(20) COLLATE utf8mb4_general_ci NOT NULL,
  `date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `atendence`
--

INSERT INTO `atendence` (`id`, `codemeli`, `atendence`, `date`) VALUES
(162, 4680355905, 'ok', '2023-10-04'),
(163, 4660731928, 'ok', '2023-10-04'),
(164, 4660730093, 'ok', '2023-10-04'),
(165, 4660735907, 'ok', '2023-10-04'),
(166, 4660719103, 'ok', '2023-10-04'),
(167, 4660752798, 'ok', '2023-10-04'),
(168, 4660745074, 'not', '2023-10-04'),
(169, 4660722066, 'ok', '2023-10-04'),
(170, 4660743497, 'ok', '2023-10-04'),
(171, 4660752305, 'ok', '2023-10-04'),
(172, 4660750094, 'ok', '2023-10-04'),
(173, 4660755861, 'ok', '2023-10-04'),
(174, 4660712664, 'ok', '2023-10-04'),
(175, 4660730344, 'ok', '2023-10-04'),
(176, 4660745831, 'ok', '2023-10-04'),
(177, 4611132013, 'ok', '2023-10-04'),
(178, 4660761355, 'not', '2023-10-04'),
(179, 4660748286, 'ok', '2023-10-04'),
(180, 4660736113, 'not', '2023-10-04'),
(181, 4660741885, 'ok', '2023-10-04');

-- --------------------------------------------------------

--
-- Table structure for table `classes`
--

CREATE TABLE `classes` (
  `id` int NOT NULL,
  `name` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `grade` int NOT NULL,
  `major` varchar(20) COLLATE utf8mb4_general_ci NOT NULL,
  `school` varchar(50) COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `classes`
--

INSERT INTO `classes` (`id`, `name`, `grade`, `major`, `school`) VALUES
(42, 'دهم 102', 10, 'تجربی', 'شاهد'),
(43, 'یازدهم 204', 11, 'ریاضی', 'شاهد'),
(44, 'دوازدهم 303', 12, 'ادبیات', 'شاهد'),
(45, ' یازدهم 203', 11, 'ادبیات', 'شاهد'),
(46, 'یازدهم 202', 11, 'تجربی', 'شاهد'),
(47, 'دوازدهم ادبیات', 12, 'ادبیات', 'ادب میلاس'),
(48, 'یازدهم ادبیات', 11, 'ادبیات', 'ادب میلاس'),
(49, 'دهم ادبیات', 10, 'ادبیات', 'ادب میلاس'),
(50, 'دهم', 10, 'ادبیات', 'شهدا'),
(51, 'یازدهم', 11, 'تجربی', 'شهدا');

-- --------------------------------------------------------

--
-- Table structure for table `monmark`
--

CREATE TABLE `monmark` (
  `id` int NOT NULL,
  `codemeli` bigint NOT NULL,
  `mark` varchar(5) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `fname` varchar(100) COLLATE utf8mb4_general_ci NOT NULL,
  `lname` varchar(100) COLLATE utf8mb4_general_ci NOT NULL,
  `class` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `school` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `monCode` int NOT NULL,
  `tarikh` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `monmark`
--

INSERT INTO `monmark` (`id`, `codemeli`, `mark`, `fname`, `lname`, `class`, `school`, `monCode`, `tarikh`) VALUES
(234, 4660764941, '19', 'اميرحسين', 'خليل طهماسبي', 'دهم', 'شهدا', 7, '2023-09-27');

-- --------------------------------------------------------

--
-- Table structure for table `schools`
--

CREATE TABLE `schools` (
  `Id` int NOT NULL,
  `name` varchar(100) COLLATE utf8mb4_general_ci NOT NULL,
  `managername` varchar(100) COLLATE utf8mb4_general_ci NOT NULL,
  `phone` varchar(15) COLLATE utf8mb4_general_ci NOT NULL,
  `address` text COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `schools`
--

INSERT INTO `schools` (`Id`, `name`, `managername`, `phone`, `address`) VALUES
(23, 'ادب میلاس', 'جعفرقلی نادری', '09133853944', 'لردگان روستای میلاس'),
(24, 'شاهد', 'بهمن نادری', '09925984874', 'لردگان جنب مدرسه توحید'),
(25, 'شهدا', 'امیرحسین جلیل', '09133853371', 'لردگان محله زمین شهری');

-- --------------------------------------------------------

--
-- Table structure for table `studentlist`
--

CREATE TABLE `studentlist` (
  `id` int NOT NULL,
  `codemeli` bigint NOT NULL,
  `fname` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `lname` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `fathername` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `major` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `school` varchar(100) COLLATE utf8mb4_general_ci NOT NULL,
  `grade` int NOT NULL,
  `class` varchar(50) COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `studentlist`
--

INSERT INTO `studentlist` (`id`, `codemeli`, `fname`, `lname`, `fathername`, `major`, `school`, `grade`, `class`) VALUES
(385, 4660742768, 'علي', 'بويري', 'ابراهيم', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(386, 4660732037, 'محمدامين', 'جليل پيران', 'خدارحم', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(387, 4660727106, 'وهاب', 'جليلي', 'جبار', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(388, 4660739295, 'مهدي', 'حسين پورآقائي', 'محمدرحيم', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(389, 4660741931, 'اميرمحمد', 'خالدي برهنه', 'عليرضا', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(390, 4660752429, 'آرمان', 'خالدي سردشتي', 'رضا', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(391, 6320112964, 'اميررضا', 'سعيدي', 'نادعلي', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(392, 4660733300, 'حسن', 'شاه حسيني دشت ارمندي', 'علي', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(393, 4660738787, 'محمدامين', 'شريفي', 'كرامت الله', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(394, 4660738388, 'اميرمحمد', 'شكري', 'محمدرضا', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(395, 4660742571, 'ياسين', 'فتاحي بارزي', 'هاشم', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(396, 4660742415, 'اميرحسين', 'كاظمي', 'ايوب', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(397, 4660720985, 'ياسر', 'محمدي خالص', 'كرامت', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(398, 4660732746, 'كاميار', 'محموديان', 'علي اصغر', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(399, 4660724565, 'محمدرضا', 'نظري', 'اكبر', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(400, 4660719405, 'امين', 'والا', 'هدايت', 'ریاضی', 'شاهد', 11, 'یازدهم 204'),
(401, 4660772871, 'ابوالفضل', 'احمدي كبير', 'علي', 'تجربی', 'شاهد', 10, 'دهم 102'),
(402, 4660766934, 'هادي', 'اميري دره رزگاه', 'علي باز', 'تجربی', 'شاهد', 10, 'دهم 102'),
(403, 6320117370, 'علي', 'بابااحمدي ميلاني', 'احمد', 'تجربی', 'شاهد', 10, 'دهم 102'),
(404, 4660771598, 'اميرمحمد', 'بابامير', 'محمد', 'تجربی', 'شاهد', 10, 'دهم 102'),
(405, 4660782131, 'محمدطاها', 'باباميرساطحي', 'مرادعلي', 'تجربی', 'شاهد', 10, 'دهم 102'),
(406, 4660775445, 'ابوالفضل', 'بني مسني', 'محمد', 'تجربی', 'شاهد', 10, 'دهم 102'),
(407, 4660760723, 'علي', 'جليل پور', 'خيرالله', 'تجربی', 'شاهد', 10, 'دهم 102'),
(408, 4660767531, 'مهدي', 'جليل پيران', 'عبدمحمد', 'تجربی', 'شاهد', 10, 'دهم 102'),
(409, 4660788415, 'حسين', 'جليل سرقلعه', 'هومان', 'تجربی', 'شاهد', 10, 'دهم 102'),
(410, 4660775046, 'محمدحسين', 'جمالي ارمندي', 'امير', 'تجربی', 'شاهد', 10, 'دهم 102'),
(411, 4660786935, 'نريمان', 'حسني', 'حسين', 'تجربی', 'شاهد', 10, 'دهم 102'),
(412, 4660782379, 'عباس', 'حسين پور', 'حجت الله', 'تجربی', 'شاهد', 10, 'دهم 102'),
(413, 4660786234, 'سيدبنيامين', 'حسيني آبچناري', 'سيداسدالله', 'تجربی', 'شاهد', 10, 'دهم 102'),
(414, 4660777944, 'ابوالفضل', 'خالدي سردشتي', 'محمدحسين', 'تجربی', 'شاهد', 10, 'دهم 102'),
(415, 4660757765, 'اميرحسين', 'خالدي سردشتي', 'مسيب', 'تجربی', 'شاهد', 10, 'دهم 102'),
(416, 4660760758, 'سيدعلي رضا', 'دانيالي', 'سيدعبدالرحيم', 'تجربی', 'شاهد', 10, 'دهم 102'),
(417, 4660768848, 'محمدمهدي', 'سعيدي ابواسحاقي', 'حميدرضا', 'تجربی', 'شاهد', 10, 'دهم 102'),
(418, 4660776409, 'محمد', 'شريفي ريگي', 'نجف', 'تجربی', 'شاهد', 10, 'دهم 102'),
(419, 4660761193, 'هادي', 'طهماسبي كرفي', 'محمد', 'تجربی', 'شاهد', 10, 'دهم 102'),
(420, 4660787427, 'محمدمتين', 'قنبري', 'صادق', 'تجربی', 'شاهد', 10, 'دهم 102'),
(421, 4660764771, 'اميرمحمد', 'قوامي', 'احمدرضا', 'تجربی', 'شاهد', 10, 'دهم 102'),
(422, 4660779238, 'اميرمحمد', 'كريمي منجرموئي', 'ابوالحسن', 'تجربی', 'شاهد', 10, 'دهم 102'),
(423, 4660761223, 'محسن', 'مالكي پور', 'محمدصادق', 'تجربی', 'شاهد', 10, 'دهم 102'),
(424, 6320116196, 'محمدمهدي', 'محمودي', 'اسحاق', 'تجربی', 'شاهد', 10, 'دهم 102'),
(425, 4660776166, 'عمادالدين', 'مرادي كلاموئي', 'صادق', 'تجربی', 'شاهد', 10, 'دهم 102'),
(426, 4660776239, 'مصطفي', 'نادري لردجاني', 'عزت الله', 'تجربی', 'شاهد', 10, 'دهم 102'),
(427, 4660789063, 'طاها', 'ويسي', 'جلال', 'تجربی', 'شاهد', 10, 'دهم 102'),
(428, 4660698807, 'رضا', 'احمدي', 'اصغر', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(429, 4660693491, 'آرمان', 'اسماعيلي', 'علي', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(430, 4660696979, 'حسن', 'اسماعيلي', 'شاهين', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(431, 4660707318, 'محمدهادي', 'انصاريان بارزي', 'نيازعلي', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(432, 4660708543, 'حسين', 'جانبازاميراني', 'شكرالله', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(433, 4660703037, 'اسماعيل', 'جليل پيران', 'مالك', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(434, 4660707792, 'احمدرضا', 'جليل سرقلعه', 'علي ظاهر', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(435, 4660689931, 'عرفان', 'جليل طهماسبي', 'تيمور', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(436, 4660678873, 'محمدجواد', 'جليل ناغوني', 'علي', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(437, 4660679985, 'هادي', 'جليلي پيران', 'هيبت الله', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(438, 4660693376, 'حسين', 'جليلي طهماسبي', 'علي قربان', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(439, 4660693112, 'محمد', 'جهاني', 'فريدون', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(440, 4660676080, 'علي', 'حبيبي', 'صفرعلي', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(441, 4660683109, 'هادي', 'حسين پور', 'محمد', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(442, 4660692574, 'محسن', 'حسيني', 'بيگ محمد', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(443, 4660692280, 'سيدنويد', 'حسيني چاهگاهي', 'سيدمحمدصادق', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(444, 4660705102, 'عادل', 'خليلي مقدم', 'انوشيروان', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(445, 4660678504, 'غلامرضا', 'خليلي مقدم', 'حشمت الله', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(446, 4660704701, 'مهدي', 'درياي لعل', 'راه خدا', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(447, 4660678377, 'مجتبي', 'رئيسي شيخ ويسي', 'عيسي', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(448, 4660684725, 'ابراهيم', 'شمسي', 'منوچهر', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(449, 4660704823, 'علي', 'كريمي منجرموئي', 'عبدالرحيم', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(450, 4660675165, 'شادمهر', 'لايقي قلعه سوخته', 'علي ناز', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(451, 4660710009, 'محمد', 'منصوري', 'امرالله', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(452, 4660682501, 'پويان', 'نوروزي مصير', 'يوسف', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(453, 4660702987, 'محمد', 'ويسي', 'ايرج', 'ادبیات', 'شاهد', 12, 'دوازدهم 303'),
(454, 4660720829, 'اميرمحمد', 'ابراهيمي', 'يحيي', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(455, 4660738612, 'سهيل', 'اردشيري لردجاني', 'ولي الله', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(456, 4220968881, 'ياسين', 'اسماعيلي پور', 'محمد', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(457, 4660720462, 'عباس', 'اكبري منجرموئي', 'حافظ', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(458, 4660735575, 'محمدجواد', 'باميري', 'قاسم', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(459, 4660713865, 'ياسر', 'جليل پيران', 'عزت الله', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(460, 4660745864, 'بابك', 'جليل شش بهره', 'تيمور', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(461, 4660715991, 'آرمين', 'حاجي پورمفرد', 'جمال', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(462, 4660735249, 'علي', 'خورشيدي', 'كشواد', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(463, 4660737780, 'محمدامين', 'دارپو', 'ولي', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(464, 4660749274, 'اميرحسين', 'رحيمي', 'اميرحسام', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(465, 6320111607, 'اميرمهدي', 'سعيدي', 'حيدر', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(466, 4660725650, 'اميرمحمد', 'شريفي ريگي', 'مجيد', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(467, 4660740528, 'حميدرضا', 'كريمي', 'محمد', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(468, 4660736776, 'ابوالفضل', 'كريمي منجرموئي', 'عزيزمحمد', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(469, 4660724743, 'سعيد', 'محمدي', 'نادر', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(470, 4660734455, 'ابراهيم', 'موسوي', 'حسين', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(471, 4660728595, 'سيدحسن', 'موسوي سردشتي', 'سيديحيي', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(472, 4660690741, 'محمدرضا', 'يوسفي دشت ارمندي', 'كيامرث', 'ادبیات', 'شاهد', 11, ' یازدهم 203'),
(473, 4660724115, 'محمدهادي', 'آبرود', 'فرهاد', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(474, 4660735583, 'شاهرخ', 'اميري ابراهيم محمدي', 'محمد', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(475, 4660720497, 'محمد', 'اميري ابراهيم محمدي', 'ضربعلي', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(476, 4660752062, 'محمدجواد', 'اميري ابراهيم محمدي', 'مجتبي', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(477, 4660739007, 'مهدي', 'اميري ابراهيم محمدي', 'يوسف', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(478, 4660726827, 'عباس', 'اميري ابراهيم محمودي', 'نوروزعلي', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(479, 4660742563, 'محمدسعيد', 'حسين پور', 'قاسمعلي', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(480, 4660724689, 'محمد', 'خالدي', 'حمدالله', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(481, 4660736210, 'اميرمحمد', 'خالدي سردشت', 'هدايت', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(482, 4660740242, 'اميدرضا', 'خالدي سردشتي', 'برات', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(483, 4660747379, 'سياوش', 'خالدي سردشتي', 'محمد', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(484, 4660741435, 'علي اكبر', 'خالدي سردشتي', 'حبيب الله', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(485, 4660738159, 'علي حسين', 'خالدي سردشتي', 'علي', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(486, 4660731650, 'يحيي', 'خالديان اصيل', 'علي', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(487, 4660731316, 'اميرمحمد', 'ذاكريان پور', 'كرامت', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(488, 4660729206, 'اسماعيل', 'غلامي', 'ولي الله', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(489, 4660730786, 'اميرمحمد', 'قاسمي تل ماراني', 'قاسمعلي', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(490, 4660751732, 'حسن', 'قنبري ميلاسي', 'رحمت الله', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(491, 4660751740, 'حسين', 'قنبري ميلاسي', 'رحمت الله', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(492, 4660726630, 'حسين', 'محمودي چالبطان', 'مظفر', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(493, 4660722643, 'امير', 'مشيري نيا', 'نظر', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(494, 4660728242, 'محمد', 'ويسي زاده', 'امير', 'ادبیات', 'ادب میلاس', 11, 'یازدهم ادبیات'),
(495, 4660760332, 'احمد', 'اسحاقي دوست', 'محمد', 'ادبیات', 'ادب میلاس', 10, 'دهم ادبیات'),
(496, 4660790991, 'عليرضا', 'اسحقي ميلاسي', 'ذبيح الله', 'ادبیات', 'ادب میلاس', 10, 'دهم ادبیات'),
(497, 4660759997, 'اميرمحمد', 'امیری', 'شهباز', 'ادبیات', 'ادب میلاس', 10, 'دهم ادبیات'),
(498, 4660762378, 'ابراهيم', 'اميري', 'راه خدا', 'ادبیات', 'ادب میلاس', 10, 'دهم ادبیات'),
(499, 4660755177, 'مهدي', 'اميري ابراهيم محمدي', 'مجيد', 'ادبیات', 'ادب میلاس', 10, 'دهم ادبیات'),
(500, 4660765814, 'عباس', 'حسين پورآقائي', 'فيروز', 'ادبیات', 'ادب میلاس', 10, 'دهم ادبیات'),
(501, 4660779912, 'حسين', 'خالدي سردشتي', 'كريم', 'ادبیات', 'ادب میلاس', 10, 'دهم ادبیات'),
(502, 4660772888, 'شاهين', 'خالدي سردشتي', 'محمدعلي', 'ادبیات', 'ادب میلاس', 10, 'دهم ادبیات'),
(503, 4660786331, 'عليرضا', 'خالدي سردشتي', 'قربانعلي', 'ادبیات', 'ادب میلاس', 10, 'دهم ادبیات'),
(504, 4660760677, 'ميثم', 'خالدي سردشتي', 'زرير', 'ادبیات', 'ادب میلاس', 10, 'دهم ادبیات'),
(505, 4660770044, 'غلامرضا', 'خالديان اصل', 'محمد', 'ادبیات', 'ادب میلاس', 10, 'دهم ادبیات'),
(506, 4660777650, 'اميرحسين', 'محمدي ميلاسي', 'سعيد', 'ادبیات', 'ادب میلاس', 10, 'دهم ادبیات'),
(507, 4660749282, 'حسين', 'ابراهيمي', 'سيف الله', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(508, 4660738892, 'احمدرضا', 'اميري ابراهيم محمدي', 'قدير', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(509, 4660743802, 'جواد', 'اميري ابراهيم محمدي', 'حبيب الله', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(510, 4660729516, 'وحيد', 'اميري شيراني', 'صفقلي', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(511, 4670420828, 'علي', 'بابااحمدي ميلاني', 'ذبيح الله', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(512, 4660724425, 'ابوالفضل', 'بابامير', 'قاسم', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(513, 4660752763, 'اميرحسين', 'بابامير', 'قربان', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(514, 4660719960, 'عرفان', 'باباميرساطحي', 'علي', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(515, 4660727051, 'ابوالفضل', 'بويرحسني باغناري', 'محسن', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(516, 4660747921, 'محمدمهدي', 'بويري منجي', 'خدامراد', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(517, 4660732101, 'علي', 'جليل پيران', 'خداداد', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(518, 4660716732, 'علي', 'جليل پيران', 'سعيد', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(519, 4660748316, 'محمدرضا', 'جليل پيران', 'آقابيگ', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(520, 4660713660, 'محمدرضا', 'جليل شاد', 'محمود', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(521, 4660739066, 'ابوالفضل', 'جليل نيا', 'خداداد', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(522, 4660747417, 'محمدرضا', 'جليلي پيران', 'فرهاد', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(523, 4660717038, 'عليرضا', 'جليلي سندگاني', 'مهدي', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(524, 4660742229, 'ابراهيم', 'حسني', 'جعفر', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(525, 4660728323, 'حسين', 'حسني ساطحي', 'يوسف', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(526, 4660749495, 'حميدرضا', 'حسني ساطحي', 'حسن', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(527, 4660725881, 'علي اصغر', 'حسني ساطحي', 'علي', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(528, 4660715965, 'عليرضا', 'حسين پورآقائي', 'بيژن', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(529, 6970063852, 'سيداميد', 'حسيني جو', 'سيدرحيم', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(530, 4660744973, 'بنيامين', 'خالدي', 'مراد', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(531, 4660721000, 'اميرمحمد', 'خالدي سردشتي', 'آيت الله', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(532, 4660730719, 'پژمان', 'خدمتي', 'نجفعلي', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(533, 4660749606, 'آريا', 'محمودي چالبطان', 'مهدي', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(534, 4660739082, 'حميدرضا', 'نادري لردجاني', 'نجفقلي', 'تجربی', 'شاهد', 11, 'یازدهم 202'),
(535, 4660700232, 'محمدرضا', 'اميري', 'ابوطالب', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(536, 4660700755, 'ابراهيم', 'اميري ابراهيم محمدي', 'اسكندر', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(537, 4660703150, 'شهاب', 'اميري ابراهيم محمدي', 'عيدي', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(538, 4660693899, 'عباس', 'اميري ابراهيم محمدي', 'سيف علي', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(539, 4660646051, 'ايوب', 'اميري دهنوئي', 'محمدعلي', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(540, 4660682560, 'مهدي', 'اميري مفرد', 'علي باز', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(541, 4660700739, 'احمد', 'اندرزي', 'غلام محمد', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(542, 4660695522, 'اشكان', 'اندرزي', 'رحمت اله', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(543, 4660692086, 'ابوالفضل', 'خالدي سردشتي', 'محمد', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(544, 4660691993, 'حسين', 'خالدي سردشتي', 'صفر', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(545, 4660689271, 'حميد', 'خالدي سردشتي', 'محمدرضا', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(546, 4660684202, 'نادر', 'خالدي سردشتي', 'علي يار', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(547, 4660706397, 'حسن', 'زعيمي تل ماراني', 'حسينعلي', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(548, 4660696995, 'احمد', 'قنبري ميلاسي', 'بهمن', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(549, 4660710408, 'احمد', 'محمدي مصيري', 'خداداد', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(550, 4660690581, 'حسين', 'محمدي مصيري', 'رحيم', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(551, 6000212429, 'حسين', 'مونسي نيا', 'كريم', 'ادبیات', 'ادب میلاس', 12, 'دوازدهم ادبیات'),
(552, 4660766241, 'ابوالفضل', 'آبرون', 'محمود', 'ادبیات', 'شهدا', 10, 'دهم'),
(553, 4660770591, 'آرمين', 'اردشيري لردجاني', 'البرز', 'ادبیات', 'شهدا', 10, 'دهم'),
(554, 4660788199, 'علي', 'جليلي پيران', 'قباد', 'ادبیات', 'شهدا', 10, 'دهم'),
(555, 4660760359, 'ميلاد', 'حاجي پور', 'محمد', 'ادبیات', 'شهدا', 10, 'دهم'),
(556, 4660777091, 'اميرمحمد', 'خالدي سردشتي', 'فتحعلي', 'ادبیات', 'شهدا', 10, 'دهم'),
(557, 4660764941, 'اميرحسين', 'خليل طهماسبي', 'مسلم', 'ادبیات', 'شهدا', 10, 'دهم'),
(558, 4660782069, 'اميررضا', 'خليلي مقدم', 'غلامرضا', 'ادبیات', 'شهدا', 10, 'دهم'),
(559, 4660768112, 'علي', 'خليلي مقدم', 'حمدالله', 'ادبیات', 'شهدا', 10, 'دهم'),
(560, 4660760030, 'محمدرضا', 'رحيمي', 'موسي', 'ادبیات', 'شهدا', 10, 'دهم'),
(561, 4660791297, 'محمد', 'رحيمي ريگي', 'ايمان', 'ادبیات', 'شهدا', 10, 'دهم'),
(562, 4660762564, 'علي', 'سليماني', 'امين اله', 'ادبیات', 'شهدا', 10, 'دهم'),
(563, 4660768430, 'فريد', 'شريفي ريگي', 'اميرقلي', 'ادبیات', 'شهدا', 10, 'دهم'),
(564, 4660753451, 'مهدي', 'كريمي اصل', 'محمد', 'ادبیات', 'شهدا', 10, 'دهم'),
(565, 4660782603, 'رضا', 'كريمي ناغوني', 'محمد', 'ادبیات', 'شهدا', 10, 'دهم'),
(566, 4660761681, 'علي', 'محمدي پرست', 'نجفقلي', 'ادبیات', 'شهدا', 10, 'دهم'),
(567, 4611155821, 'احمد', 'محموديان', 'محمود', 'ادبیات', 'شهدا', 10, 'دهم'),
(568, 4660778096, 'سيدعلي', 'موسوي بيدله', 'سيدمحمد', 'ادبیات', 'شهدا', 10, 'دهم'),
(569, 4680355905, 'اميرمحمد', 'اسدي اردلي', 'اميرعلي', 'تجربی', 'شهدا', 11, 'یازدهم'),
(570, 4660731928, 'اميد', 'ايمور', 'علي صفر', 'تجربی', 'شهدا', 11, 'یازدهم'),
(571, 4660730093, 'حميدرضا', 'بامدادي تنها', 'رسول', 'تجربی', 'شهدا', 11, 'یازدهم'),
(572, 4660741885, 'محسن', 'پرژك', 'حفيظ الله', 'تجربی', 'شهدا', 11, 'یازدهم'),
(573, 4660735907, 'يونس', 'حسيني كينكي', 'عين الله', 'تجربی', 'شهدا', 11, 'یازدهم'),
(574, 4660719103, 'سليمان', 'خالدي', 'علي', 'تجربی', 'شهدا', 11, 'یازدهم'),
(575, 4660752798, 'افشين', 'خالدي يار', 'ادريس', 'تجربی', 'شهدا', 11, 'یازدهم'),
(576, 4660745074, 'علي اصغر', 'خالديان چهارم', 'فرود', 'تجربی', 'شهدا', 11, 'یازدهم'),
(577, 4660722066, 'ابوالفضل', 'خدمتي', 'مرتضي', 'تجربی', 'شهدا', 11, 'یازدهم'),
(578, 4660743497, 'عليرضا', 'خليل طهماسبي', 'بابك', 'تجربی', 'شهدا', 11, 'یازدهم'),
(579, 4660752305, 'ابوالفضل', 'رحيمي ريگي', 'محمد', 'تجربی', 'شهدا', 11, 'یازدهم'),
(580, 4660750094, 'حسين', 'سليمي پور', 'جعفر', 'تجربی', 'شهدا', 11, 'یازدهم'),
(581, 4660755861, 'حميدرضا', 'صالحي', 'ذبيح الله', 'تجربی', 'شهدا', 11, 'یازدهم'),
(582, 4660712664, 'حسين', 'فرهمند', 'صادق', 'تجربی', 'شهدا', 11, 'یازدهم'),
(583, 4660730344, 'حسين', 'محمدي مصيري', 'احمد', 'تجربی', 'شهدا', 11, 'یازدهم'),
(584, 4660745831, 'حسين', 'محمدي مصيري', 'فيروزاله', 'تجربی', 'شهدا', 11, 'یازدهم'),
(585, 4611132013, 'اميرحسين', 'منصوري', 'اسلام', 'تجربی', 'شهدا', 11, 'یازدهم'),
(586, 4660761355, 'مهدي', 'موسوي', 'يعقوب', 'تجربی', 'شهدا', 11, 'یازدهم'),
(587, 4660748286, 'مهرشاد', 'موسوي', 'اكبر', 'تجربی', 'شهدا', 11, 'یازدهم'),
(588, 4660736113, 'عليرضا', 'نادري لردجاني', 'آيت الله', 'تجربی', 'شهدا', 11, 'یازدهم');

-- --------------------------------------------------------

--
-- Table structure for table `task`
--

CREATE TABLE `task` (
  `id` int NOT NULL,
  `activity` text COLLATE utf8mb4_general_ci NOT NULL,
  `level` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `ststus` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT 'not-done',
  `date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int NOT NULL,
  `username` varchar(100) COLLATE utf8mb4_general_ci NOT NULL,
  `fname` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `lname` varchar(150) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `email` varchar(150) COLLATE utf8mb4_general_ci NOT NULL,
  `phoneNumber` varchar(11) COLLATE utf8mb4_general_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `profilePicture` varchar(255) COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `fname`, `lname`, `email`, `phoneNumber`, `password`, `date`, `profilePicture`) VALUES
(17, 'hossein', 'hossein', 'mansoori', 'hossein', '09134469032', '81dc9bdb52d04dc20036dbd8313ed055', '2023-07-24 17:44:21', 'profile_pic24504_.jpg'),
(18, 'Roz', 'Roz', 'Abdolkhani', 'Roz', '091', '81dc9bdb52d04dc20036dbd8313ed055', '2023-08-02 17:01:44', 'profile_pic18007_.png');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `atendence`
--
ALTER TABLE `atendence`
  ADD PRIMARY KEY (`id`),
  ADD KEY `codemeli` (`codemeli`);

--
-- Indexes for table `classes`
--
ALTER TABLE `classes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `school` (`school`),
  ADD KEY `name` (`name`);

--
-- Indexes for table `monmark`
--
ALTER TABLE `monmark`
  ADD PRIMARY KEY (`id`),
  ADD KEY `codemeli` (`codemeli`);

--
-- Indexes for table `schools`
--
ALTER TABLE `schools`
  ADD PRIMARY KEY (`Id`),
  ADD KEY `name` (`name`);

--
-- Indexes for table `studentlist`
--
ALTER TABLE `studentlist`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `codemeli` (`codemeli`),
  ADD KEY `school` (`school`),
  ADD KEY `class` (`class`);

--
-- Indexes for table `task`
--
ALTER TABLE `task`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `atendence`
--
ALTER TABLE `atendence`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=182;

--
-- AUTO_INCREMENT for table `classes`
--
ALTER TABLE `classes`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- AUTO_INCREMENT for table `monmark`
--
ALTER TABLE `monmark`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=235;

--
-- AUTO_INCREMENT for table `schools`
--
ALTER TABLE `schools`
  MODIFY `Id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT for table `studentlist`
--
ALTER TABLE `studentlist`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=589;

--
-- AUTO_INCREMENT for table `task`
--
ALTER TABLE `task`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `atendence`
--
ALTER TABLE `atendence`
  ADD CONSTRAINT `atendence_ibfk_1` FOREIGN KEY (`codemeli`) REFERENCES `studentlist` (`codemeli`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `classes`
--
ALTER TABLE `classes`
  ADD CONSTRAINT `classes_ibfk_1` FOREIGN KEY (`school`) REFERENCES `schools` (`name`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `monmark`
--
ALTER TABLE `monmark`
  ADD CONSTRAINT `codemeli` FOREIGN KEY (`codemeli`) REFERENCES `studentlist` (`codemeli`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `studentlist`
--
ALTER TABLE `studentlist`
  ADD CONSTRAINT `class` FOREIGN KEY (`class`) REFERENCES `classes` (`name`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `school` FOREIGN KEY (`school`) REFERENCES `schools` (`name`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
