-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Aug 17, 2023 at 10:06 PM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `1402s1403`
--

-- --------------------------------------------------------

--
-- Table structure for table `atendence`
--

CREATE TABLE `atendence` (
  `id` int(11) NOT NULL,
  `codemeli` bigint(10) NOT NULL,
  `atendence` varchar(20) NOT NULL,
  `date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `atendence`
--

INSERT INTO `atendence` (`id`, `codemeli`, `atendence`, `date`) VALUES
(27, 4660742768, 'ok', '2023-10-22'),
(28, 4660745864, 'not', '2023-10-22'),
(29, 4660732037, 'ok', '2023-10-22'),
(30, 4660713865, 'ok', '2023-10-22'),
(31, 4660727106, 'ok', '2023-10-22'),
(32, 4660715991, 'ok', '2023-10-22'),
(33, 4660739295, 'ok', '2023-10-22'),
(34, 4660651533, 'ok', '2023-10-22'),
(35, 4660723321, 'ok', '2023-10-22'),
(36, 4660656888, 'ok', '2023-10-22'),
(37, 4660643921, 'ok', '2023-10-22'),
(38, 4660741931, 'ok', '2023-10-22'),
(39, 4660752429, 'not', '2023-10-22'),
(40, 4660653269, 'ok', '2023-10-22'),
(41, 4660667596, 'ok', '2023-10-22'),
(42, 4660672530, 'ok', '2023-10-22'),
(43, 4660654257, 'ok', '2023-10-22'),
(44, 4660656195, 'ok', '2023-10-22'),
(45, 4660674444, 'ok', '2023-10-22'),
(46, 4660651010, 'ok', '2023-10-22'),
(47, 4660643093, 'ok', '2023-10-22'),
(48, 4660735249, 'ok', '2023-10-22'),
(49, 4660737780, 'ok', '2023-10-22'),
(50, 4660749274, 'not', '2023-10-22'),
(51, 4660721701, 'ok', '2023-10-22'),
(52, 6320112964, 'ok', '2023-10-22'),
(53, 6320111607, 'ok', '2023-10-22'),
(54, 4660733300, 'ok', '2023-10-22'),
(55, 4660738787, 'ok', '2023-10-22'),
(56, 4660725650, 'ok', '2023-10-22'),
(57, 4660738388, 'ok', '2023-10-22'),
(58, 4660741648, 'not', '2023-10-22'),
(59, 4660655105, 'ok', '2023-10-22'),
(60, 4660657809, 'ok', '2023-10-22'),
(61, 4660742571, 'ok', '2023-10-22'),
(62, 4660654575, 'ok', '2023-10-22'),
(63, 4660742415, 'ok', '2023-10-22'),
(64, 4660740528, 'ok', '2023-10-22'),
(65, 4660736776, 'ok', '2023-10-22'),
(66, 4660673065, 'ok', '2023-10-22'),
(67, 4660724743, 'ok', '2023-10-22'),
(68, 4660661180, 'ok', '2023-10-22'),
(69, 4660720985, 'ok', '2023-10-22'),
(70, 4660727483, 'ok', '2023-10-22'),
(71, 4660732746, 'not', '2023-10-22'),
(72, 4660732800, 'ok', '2023-10-22'),
(73, 4660652424, 'ok', '2023-10-22'),
(74, 632006267, 'ok', '2023-10-22'),
(75, 4660008118, 'ok', '2023-10-22'),
(76, 4660734455, 'ok', '2023-10-22'),
(77, 4660728595, 'ok', '2023-10-22'),
(78, 4660724565, 'ok', '2023-10-22'),
(79, 4660719405, 'ok', '2023-10-22'),
(80, 6970038424, 'ok', '2023-10-22'),
(81, 4660673634, 'ok', '2023-10-22'),
(82, 4660690741, 'ok', '2023-10-22');

-- --------------------------------------------------------

--
-- Table structure for table `classes`
--

CREATE TABLE `classes` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `grade` int(2) NOT NULL,
  `major` varchar(20) NOT NULL,
  `school` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `classes`
--

INSERT INTO `classes` (`id`, `name`, `grade`, `major`, `school`) VALUES
(28, 'دهم 102', 10, 'تجربی', 'شاهد'),
(29, 'دهم 103', 10, 'ادبیات', 'شاهد'),
(30, 'دهم 104', 10, 'ریاضی', 'شاهد'),
(31, 'دهم ادبیات', 10, 'ادبیات', 'ادب میلاس'),
(32, 'یازدهم ادبیات', 11, 'ادبیات', 'ادب میلاس'),
(33, 'دوازدهم ادبیات', 12, 'ادبیات', 'ادب میلاس'),
(34, 'دهم کامپیوتر', 10, 'کامپیوتر', 'ادب میلاس'),
(35, 'دهم صدرا', 10, 'ادبیات', 'دین و دانش');

-- --------------------------------------------------------

--
-- Table structure for table `monmark`
--

CREATE TABLE `monmark` (
  `id` int(11) NOT NULL,
  `codemeli` bigint(10) NOT NULL,
  `mark` varchar(5) DEFAULT NULL,
  `fname` varchar(100) NOT NULL,
  `lname` varchar(100) NOT NULL,
  `class` varchar(50) NOT NULL,
  `school` varchar(50) NOT NULL,
  `monCode` int(2) NOT NULL,
  `tarikh` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `monmark`
--

INSERT INTO `monmark` (`id`, `codemeli`, `mark`, `fname`, `lname`, `class`, `school`, `monCode`, `tarikh`) VALUES
(212, 6320062967, '15', 'حسین', 'منصوری', 'دهم صدرا', 'دین و دانش', 7, '2023-10-12'),
(213, 6320062967, '20', 'حسین', 'منصوری', 'دهم صدرا', 'دین و دانش', 7, '2023-10-01'),
(214, 6320037008, '13', 'مریم', 'منصوری', 'دهم صدرا', 'دین و دانش', 7, '2023-10-02'),
(215, 6320062967, '14', 'حسین', 'منصوری', 'دهم صدرا', 'دین و دانش', 3, '0000-00-00'),
(216, 6320062967, '20', 'حسین', 'منصوری', 'دهم صدرا', 'دین و دانش', 3, '0000-00-00');

-- --------------------------------------------------------

--
-- Table structure for table `schools`
--

CREATE TABLE `schools` (
  `Id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `managername` varchar(100) NOT NULL,
  `phone` varchar(15) NOT NULL,
  `address` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `schools`
--

INSERT INTO `schools` (`Id`, `name`, `managername`, `phone`, `address`) VALUES
(13, 'ادب میلاس', 'جعفرقلی نادری', '09133853944', 'لردگان روستای میلاس'),
(14, 'دین و دانش', 'علی بخش جلیل', '0913', 'لردگان رو به روی بیمارستان'),
(15, 'شاهد', 'بهمن نادری', '091313', 'لردگان محله زمین شهری');

-- --------------------------------------------------------

--
-- Table structure for table `studentlist`
--

CREATE TABLE `studentlist` (
  `id` int(11) NOT NULL,
  `codemeli` bigint(10) NOT NULL,
  `fname` varchar(50) NOT NULL,
  `lname` varchar(50) NOT NULL,
  `fathername` varchar(50) NOT NULL,
  `major` varchar(50) NOT NULL,
  `school` varchar(100) NOT NULL,
  `grade` int(2) NOT NULL,
  `class` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `studentlist`
--

INSERT INTO `studentlist` (`id`, `codemeli`, `fname`, `lname`, `fathername`, `major`, `school`, `grade`, `class`) VALUES
(142, 6320037008, 'مریم', 'منصوری', 'بیژن', 'ادبیات', 'دین و دانش', 10, 'دهم صدرا'),
(143, 6320062967, 'حسین', 'منصوری', 'بیژن', 'ادبیات', 'دین و دانش', 10, 'دهم صدرا'),
(146, 632006267, 'حسین', 'منصوری', 'بیژن', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(147, 4660008118, 'زهرا', 'منصوری', 'بیژن', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(148, 4660714241, 'مهدی', 'اسحاقی میلاسی', 'علی عسگر', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(149, 4660740307, 'رضا', 'امیری', 'محمود', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(150, 4660716414, 'احمدرضا', 'بویری', 'حجت الله', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(151, 4660742768, 'علی', 'بویری', 'ابراهیم', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(152, 4660732037, 'محمدامین', 'جلیل پیران', 'خدارحم', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(153, 4660727106, 'وهاب', 'جلیلی', 'جبار', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(154, 4660739295, 'مهدی', 'حسین پورآقائی', 'محمدرحیم', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(155, 4660741931, 'امیرمحمد', 'خالدی برهنه', 'علیرضا', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(156, 4660752429, 'آرمان', 'خالدی سردشتی', 'رضا', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(157, 4660721701, 'مجتبی', 'روزدار', 'برزو', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(158, 6320112964, 'امیررضا', 'سعیدی', 'نادعلی', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(159, 4660733300, 'حسن', 'شاه حسینی دشت ارمندی', 'علی', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(160, 4660738787, 'محمدامین', 'شریفی', 'كرامت الله', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(161, 4660738388, 'امیرمحمد', 'شكری', 'محمدرضا', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(162, 4660741648, 'رضا', 'شیرمردی', 'خلیل', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(163, 4660742571, 'یاسین', 'فتاحی بارزی', 'هاشم', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(164, 4660742415, 'امیرحسین', 'كاظمی', 'ايوب', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(165, 4660720985, 'یاسر', 'محمدی خالص', 'كرامت', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(166, 4660727483, 'نیما', 'محمدی میلاسی', 'حسن', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(167, 4660732746, 'كامیار', 'محمودیان', 'علی اصغر', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(168, 4660724565, 'محمدرضا', 'نظری', 'اكبر', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(169, 4660719405, 'امین', 'والا', 'هدایت', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(170, 4660720829, 'امیرمحمد', 'ابراهیمی', 'یحیی', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(171, 4660738612, 'سهیل', 'اردشیری لردجانی', 'ولي الله', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(172, 4220968881, 'یاسین', 'اسماعیلی پور', 'محمد', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(173, 4660735575, 'محمدجواد', 'بامیری', 'قاسم', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(174, 4660713865, 'یاسر', 'جلیل پیران', 'عزت الله', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(175, 4660745864, 'بابك', 'جلیل شش بهره', 'تیمور', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(176, 4660715991, 'آرمین', 'حاجی پورمفرد', 'جمال', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(177, 4660723321, 'علی رضا', 'خالدی', 'علی', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(178, 4660735249, 'علی', 'خورشیدی', 'كشواد', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(179, 4660737780, 'محمدامین', 'دارپو', 'ولی', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(180, 4660749274, 'امیرحسین', 'رحیمی', 'امیرحسام', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(181, 6320111607, 'امیرمهدی', 'سعیدی', 'حیدر', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(182, 4660725650, 'امیرمحمد', 'شریفی ریگی', 'مجید', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(183, 4660740528, 'حمیدرضا', 'كریمی', 'محمد', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(184, 4660736776, 'ابوالفضل', 'كریمی منجرموئی', 'عزیزمحمد', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(185, 4660724743, 'سعید', 'محمدی', 'نادر', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(186, 4660732800, 'رضا', 'مرادی دشت ارمندی', 'ایوب', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(187, 4660734455, 'ابراهیم', 'موسوی', 'حسین', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(188, 4660728595, 'سیدحسن', 'موسوی سردشتی', 'سیدیحیی', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(189, 4660690741, 'محمدرضا', 'یوسفی دشت ارمندی', 'كیامرث', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(190, 4660655830, 'حسن', 'آقائی مقدم', 'علی', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(191, 4660648818, 'مالك', 'آقائی مقدم', 'امین', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(192, 4660654087, 'یاسر', 'ابراهیم محمدی', 'خداخواست', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(193, 4660664831, 'احسان', 'امیری', 'سهراب', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(194, 4660638642, 'احمدرضا', 'امیری', 'فرهاد', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(195, 4660643085, 'حامد', 'امیری ابراهیم محمدی', 'علی باز', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(196, 4660638898, 'سجاد', 'امیری ابراهیم محمدی', 'داراب', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(197, 4660673847, 'متین', 'امیری ابراهیم محمدی', 'سردار', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(198, 4660671747, 'محمدجواد', 'امیری ابراهیم محمدی', 'ولی محمد', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(199, 4660651894, 'بنیامین', 'امیری ابراهیم محمودی', 'كرمعلی', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(200, 4660664724, 'هادی', 'امیری ده نوئی', 'غضنفر', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(201, 4660647821, 'علیرضا', 'امیری دهنوئی', 'بهرام', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(202, 4660652912, 'حسین', 'انداشكر', 'حاتم', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(203, 4660645754, 'محمد', 'اندرزی', 'ولی محمد', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(204, 4660655865, 'علی', 'بابامیر', 'البرز', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(205, 6970038424, 'عسكر', 'پورعارف', 'غفار', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(206, 4660673634, 'حمید', 'پورعامری', 'امرالله', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(207, 4660651533, 'ابوالفضل', 'حسین پورآقائی', 'بیژن', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(208, 4660656888, 'حمیدرضا', 'خالدی', 'نگهدار', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(209, 4660643921, 'میلاد', 'خالدی', 'امامقلی', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(210, 4660653269, 'اصغر', 'خالدی سردشتی', 'محمدعلی', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(211, 4660667596, 'پدرام', 'خالدی سردشتی', 'جعفر', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(212, 4660672530, 'حسن', 'خالدی سردشتی', 'حسین', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(213, 4660654257, 'صفدر', 'خالدی سردشتی', 'كیومرث', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(214, 4660656195, 'علی', 'خالدی سردشتی', 'فایز', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(215, 4660674444, 'علی اكبر', 'خالدی سردشتی', 'حجت الله', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(216, 4660651010, 'محمدمهدی', 'خالدی سردشتی', 'قاسم', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(217, 4660643093, 'محمد', 'خالدی صفت', 'باقر', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(218, 4660655105, 'محمدمهدی', 'عنصری زاده', 'علی', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(219, 4660657809, 'ابراهیم', 'غلامی', 'ولی الله', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(220, 4660654575, 'بهنام', 'قنبری میلاسی', 'غلامرضا', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(221, 4660673065, 'شهرام', 'كریمی منجرموئی', 'عبدالحسین', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(222, 4660661180, 'مهدی', 'محمدی', 'خدامراد', 'ریاضی', 'شاهد', 10, 'دهم 104'),
(223, 4660652424, 'هادی', 'مسلمان جو', 'مهدی', 'ریاضی', 'شاهد', 10, 'دهم 104');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(100) NOT NULL,
  `fname` varchar(200) NOT NULL,
  `lname` varchar(150) NOT NULL,
  `email` varchar(150) NOT NULL,
  `phoneNumber` varchar(11) NOT NULL,
  `password` varchar(255) NOT NULL,
  `date` datetime NOT NULL DEFAULT current_timestamp(),
  `profilePicture` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `fname`, `lname`, `email`, `phoneNumber`, `password`, `date`, `profilePicture`) VALUES
(17, 'hossein', 'hossein', 'mansoori', 'hossein', '09134469032', '81dc9bdb52d04dc20036dbd8313ed055', '2023-07-24 17:44:21', 'profile_pic24504_.jpg'),
(18, 'parpari', 'پریناز', 'خانی', 'parpari@gmail.com', '091', '81dc9bdb52d04dc20036dbd8313ed055', '2023-08-02 17:01:44', 'profile_pic18007_.png');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `atendence`
--
ALTER TABLE `atendence`
  ADD PRIMARY KEY (`id`),
  ADD KEY `codemeli` (`codemeli`);

--
-- Indexes for table `classes`
--
ALTER TABLE `classes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `school` (`school`),
  ADD KEY `name` (`name`);

--
-- Indexes for table `monmark`
--
ALTER TABLE `monmark`
  ADD PRIMARY KEY (`id`),
  ADD KEY `codemeli` (`codemeli`);

--
-- Indexes for table `schools`
--
ALTER TABLE `schools`
  ADD PRIMARY KEY (`Id`),
  ADD KEY `name` (`name`);

--
-- Indexes for table `studentlist`
--
ALTER TABLE `studentlist`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `codemeli` (`codemeli`),
  ADD KEY `school` (`school`),
  ADD KEY `class` (`class`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `atendence`
--
ALTER TABLE `atendence`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=83;

--
-- AUTO_INCREMENT for table `classes`
--
ALTER TABLE `classes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- AUTO_INCREMENT for table `monmark`
--
ALTER TABLE `monmark`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=217;

--
-- AUTO_INCREMENT for table `schools`
--
ALTER TABLE `schools`
  MODIFY `Id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `studentlist`
--
ALTER TABLE `studentlist`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=224;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `atendence`
--
ALTER TABLE `atendence`
  ADD CONSTRAINT `atendence_ibfk_1` FOREIGN KEY (`codemeli`) REFERENCES `studentlist` (`codemeli`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `classes`
--
ALTER TABLE `classes`
  ADD CONSTRAINT `classes_ibfk_1` FOREIGN KEY (`school`) REFERENCES `schools` (`name`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `monmark`
--
ALTER TABLE `monmark`
  ADD CONSTRAINT `codemeli` FOREIGN KEY (`codemeli`) REFERENCES `studentlist` (`codemeli`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `studentlist`
--
ALTER TABLE `studentlist`
  ADD CONSTRAINT `class` FOREIGN KEY (`class`) REFERENCES `classes` (`name`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `school` FOREIGN KEY (`school`) REFERENCES `schools` (`name`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
